


const get_batch_list = (id, target, title, image) => {
    spinner("start");
// یک آیدی بگیر و دسته هایی که پدرشون این آیدی هست رو به من پس بده
    $.post("backend/backend.php", {
        "code": "get_batch_list",
        "id"  : id
    }, function(data) {
        console.log("debugging", data);
        data = data.data;
        fill_batch_list(data, target, image, title);
    });
    // let data = {
    //     1: {
    //         "name": "بارداری",
    //         "id": "3370"
    //     },
    //     2: {
    //         "name": "دوران بلوغ",
    //         "id": "3372"
    //     },
    //     3: {
    //         "name": "ورزشکاران",
    //         "id": "3371"
    //     },
    //     4: {
    //         "name": "ضد پیری",
    //         "id": "3370"
    //     }
    // };
};

const get_list_item = (id, target, title) => {
    spinner("start");
    // یک ID بگیر و آیتم هایی که پدرشون این ID هست رو به من بده
    $.post("backend/backend.php", {
        "code": "get_list_item",
        "id"  : id
    }, function(data) {
        console.log("3", data);
        data = data.data;
        fill_list_items(data, target, title);
    }, "json");
    // let data = {
    //     1: {
    //         "name": "آمین وی  4600 شکلاتی® قرص 243 عددی * AMIN WHEY 4600 CHOCOLATE® TAB 243",
    //         "id": "6759",
    //         "image": "6759.jpg",
    //         "price": "51840",
    //         "description_short": "\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_normal": "\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_pdf": "6759.pdf"
    //     },
    //     2: {
    //         "name": "آمین وی  4600 شکلاتی® قرص 243 عددی * AMIN WHEY 4600 CHOCOLATE® TAB 243",
    //         "id": "6758",
    //         "image": "6759.jpg",
    //         "price": "51840",
    //         "description_short": "\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_normal": "\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_pdf": "6759.pdf"
    //     },
    //     3: {
    //         "name": "آمین وی  4600 شکلاتی® قرص 243 عددی * AMIN WHEY 4600 CHOCOLATE® TAB 243",
    //         "id": "6757",
    //         "image": "6759.jpg",
    //         "price": "51840",
    //         "description_short": "\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_normal": "\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_pdf": "6759.pdf"
    //     },
    //     4: {
    //         "name": "آمین وی  4600 شکلاتی® قرص 243 عددی * AMIN WHEY 4600 CHOCOLATE® TAB 243",
    //         "id": "6756",
    //         "image": "6759.jpg",
    //         "price": "51840",
    //         "description_short": "\nکمک به عضله سازی و افزایش\nحجم عضلات \nپیشگیری از تحلیل عضلانی پس\nاز مسابقه\n100% مخلوط پروتئین های Whey\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_normal": "\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_pdf": "6759.pdf"
    //     },
    // };
};

const get_root_item = (id , target, title) => {
    // شاپ آیدی بگیر و دسته های اصلیشو به من بده
    spinner("start");
    $.post("backend/backend.php", {
        "code": "get_root_item",
        "shop_id"  : id
    }, function(data) {
        console.log("10", data);
        data = data.data;
        fill_root_item(data, target, title);
    });
    // let data = {
    //     1: {
    //         "name": "مکمل ها",
    //         "id": "3370",
    //         "image": "images/suppliment.png"
    //     },
    //     2: {
    //         "name": "آرایشی",
    //         "id": "3370",
    //         "image": "images/suppliment.png"
    //     },
    //     3: {
    //         "name": "بهداشتی",
    //         "id": "3370",
    //         "image": "images/suppliment.png"
    //     }
    // };
};

// const profile_get = user_id => {
//    // یه آیدی یوزر بهت میدم مشخصات یوزر رو به من بده
//     console.log(user_id);
//     let data = {
//         "image": "images/profile.png",
//         "name": "طاها شجریان",
//         "phone": "09216317519",
//         "gender": "1",
//         "birth_day": "674956800"
//     };
//     profile_fill(data, "#profile_page_1");
// };

const wallet_get = () => {
    // یوزر آیدی بهت میدم مبلغ کیف پولشو بهم بده به همراه تراکنشاش تو جدول ولت
    //  اگه یوزر رو نداری بهم بگو که بگم لاگین کنه اگه هم داری چیزایی که ازت میخام رو بهم بده
    let data = {
        "amount_wallet": "13000",
        "invoice": {
            "0": {
                "date": "1397/05/01",
                "operator": "buy",
                "amount": "10000",
                "inventory": "14000"
            },
            "1": {
                "date": "1397/06/01",
                "operator": "buy",
                "amount": "10000",
                "inventory": "14000"
            },
            "2": {
                "date": "1397/07/01",
                "operator": "buy",
                "amount": "10000",
                "inventory": "14000"
            },
            "3": {
                "date": "1397/08/01",
                "operator": "buy",
                "amount": "10000",
                "inventory": "14000"
            },
            "4": {
                "date": "1397/09/01",
                "operator": "buy",
                "amount": "10000",
                "inventory": "14000"
            },
            "5": {
                "date": "1397/10/01",
                "operator": "buy",
                "amount": "10000",
                "inventory": "14000"
            },
            "6": {
                "date": "1397/11/01",
                "operator": "buy",
                "amount": "10000",
                "inventory": "14000"
            },
            "7": {
                "date": "1397/12/01",
                "operator": "buy",
                "amount": "10000",
                "inventory": "14000"
            }
        }
    };
    wallet_fill(data, "#wallet_page_1");
};

const history_orders_get = user_id => {
    // یوزر آیدی بهت میدم تاریخچه سفارشاش رو بهم بده
    console.log(user_id);
    let data = {
        1 : {
            "order_id": "256452",
            "date": "2552454",
            "shop_name": "دکتر مبارکی",
            "order_items": "فروگلوبین ویتابیوتی",
            "order_price": "20000"
        },
        2 : {
            "order_id": "256453",
            "date": "2564454",
            "shop_name": "دکتر مبارکی",
            "order_items": "فروگلوبین ویتابیوتی",
            "order_price": "20000"
        },
        3 : {
            "order_id": "256454",
            "date": "225454",
            "shop_name": "دکتر مبارکی",
            "order_items": "فروگلوبین ویتابیوتی",
            "order_price": "20000"
        },
        4 : {
            "order_id": "256455",
            "date": "2564454",
            "shop_name": "دکتر مبارکی",
            "order_items": "فروگلوبین ویتابیوتی",
            "order_price": "20000"
        }
    };
    history_orders_fill(data, "#history_table_tbody");
};

const history_order_get_details = order_id => {
    // اردر آیدی بهت میدم و مشخصات اون اردر رو بهم بده
    console.log(order_id);
    let data = {
        "main_price": "240000",
        "items": {
            1: { 
            "name":"فروگلوبین ویتابیوتیکس",
            "item_count":"2",
            "price":"120000",
            },
            2: {
                "name":"فروگلوبین ویتابیوتیکس",
                "item_count":"2",
                "price":"120000",
            }
        },
        "order_id": "545421",
        "date": "8/12/1397",
        "vat": "0",
        "transport": "0",
        "wallet": "13000",
        "discount": "2000",
        "status": "پایان یافنه",
        "payment": "پرداخت شده",
        "address": "میدان مادر نبش مددکاران حیابان مددکاران پلاک 26 واحد 2"
    };
    history_orders_fill_details(data, "#history_page_2");
    next_page("شرح سفارش");
};

const search_item = searched => {
   // یه استرینگ بهت میدم تو آیتم ها و تو دسته ها سرچ کن و نتیجه رو بهم بده
   spinner("start");
   $.post("backend/backend.php", {
       "code": "search_item",
       "name": searched
    }, function (data) {
        console.log("searched", data);
        data = data.data;
        fill_list_items(data, "#search_page_2 ul", searched);
    });
    // console.log(searched);
    // let data = {
    //     1: {
    //         "name": "آمین وی  4600 شکلاتی® قرص 243 عددی * AMIN WHEY 4600 CHOCOLATE® TAB 243",
    //         "id": "6759",
    //         "image": "6759.jpg",
    //         "price": "51840",
    //         "description_short": "\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_normal": "\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_pdf": "6759.pdf"
    //     },
    //     2: {
    //         "name": "آمین وی  4600 شکلاتی® قرص 243 عددی * AMIN WHEY 4600 CHOCOLATE® TAB 243",
    //         "id": "6759",
    //         "image": "6759.jpg",
    //         "price": "51840",
    //         "description_short": "\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_normal": "\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_pdf": "6759.pdf"
    //     },
    //     3: {
    //         "name": "آمین وی  4600 شکلاتی® قرص 243 عددی * AMIN WHEY 4600 CHOCOLATE® TAB 243",
    //         "id": "6759",
    //         "image": "6759.jpg",
    //         "price": "51840",
    //         "description_short": "\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_normal": "\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_pdf": "6759.pdf"
    //     },
    //     4: {
    //         "name": "آمین وی  4600 شکلاتی® قرص 243 عددی * AMIN WHEY 4600 CHOCOLATE® TAB 243",
    //         "id": "6759",
    //         "image": "6759.jpg",
    //         "price": "51840",
    //         "description_short": "\nکمک به عضله سازی و افزایش\nحجم عضلات \nپیشگیری از تحلیل عضلانی پس\nاز مسابقه\n100% مخلوط پروتئین های Whey\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_normal": "\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .\\r\\n\\r\\nکمک به عضله سازی و افزایش\\r\\nحجم عضلات \\r\\nپیشگیری از تحلیل عضلانی پس\\r\\nاز مسابقه\\r\\n\\r\\n-\\r\\n100% مخلوط پروتئین های Whey\\r\\n\\r\\nآمینو وی 4600 یک منبع پروتئینی با ارزش بیولوژیکی بالا ،\\r\\nتهیه شده از بهترین نوع پروتئین آب پنیر می باشد . این محصول بهترین منبع اسید های\\r\\nآمینه ضروری ، غیر ضروری و اسید های آمینه شاخه دار با ارزش تغذیه ای بالا است .",
    //         "description_pdf": "6759.pdf"
    //     }
    // };
};

const bascket_get = (user_id, shop_id) => {
    // یوزر آیدی و شاپ آیدی رو بگیر و سبد خریدش رو به من بده
    data = order_list;
    bascket_fill(data);
    console.log(user_id, shop_id);
};


//////////////////////////// V2 ///////////////////////////////

const get_order_complete = (title, target) => {
    // نمیدونم چی باید بهت بدم ولی تو کل اردر رو با همه جزئیاتش بهم بده
    // تمپلیتشم که الان درست میکنم الکیه خودت درستشو بده
    let data = {
        "items": order_list,
        "vat": "2000",
        "transport": "5000",
        "discount": 13000
    };
    if (user) {
        select_address(data, title, target);
    } else {
        user_login();
    }
};

const user_get =  (target=null) => {
  // اگه یوزر رو داری خب بدش به من اگه نداری بگو تا بگم بهش که لاگین کنه
    // در واقع الان نمیدونم من باید چی بهت بدم که تو بفهمی کی رو باید به من بدی
    /**   ?   */
    let data = {
        "image": "images/profile.png",
        "name": "طاها شجریان",
        "phone": "09216317519",
        "gender": "1",
        "birth_day": "1370/3/1",
        "amount_wallet": "13000"
    };
        //console.log("user_get", data)
    // OR data = null
    data = null; //    Assigned expression type null is not assignable to type {image: string, name: string, phone: string, gender: string, birth_day: string}
    if (target) {
        profile_fill(data, "#profile_page_1");
    }
    if (data) {
        // do somthin
    } else {
        user_login();
    }
};

const user_login_send_code_to_user = (phone, location) => {
    // شماره تلفن رو بهت میدم یه چیزی به من بده که بگی آره فرستادم براش
    spinner("start");
    $.post("backend/backend.php", {
        "code": "user_login_send_code_to_user",
        "phone"  : phone,
        "location": location
    }, function(data) {
        console.log("send", data); 
        result_send_sms(data);
    });
    // let data = {
    //    "status": "ok",
    //     "message": "کد به شماره تلفن شما ارسال شد"
    // };
    // // OR
    // // data = {
    // //     "status": "fail",
    // //     "message": "مشکل در ارسال کد"
    // // };
    // return data;
};

const user_login_verify_code = (code) => {
    spinner('start');
    console.log("اومد این این تو دیگه کد رو دارم میدم به مهرشاد");
    console.log(code);
    // کدی که یوزر دریافت کرده رو بهت میدم بهم بگو کدش درسته یا غلطه
    //دوست عزیز،شماره تلفن را هم بفرست.مهرشاد
    $.post("backend/backend.php", {
        code: "user_login_verify_code",
        pin: code
    }, function (data) {
        console.log(data);
        result_user_login_verify_code(data);
    });

    // let data = {
    //     "status": "ok",
    //     "message": "کد صحیح است",
    //     "data":  {
    //         "image": "images/profile.png",
    //         "name": "طاها شجریان",
    //         "phone": "09216317519",
    //         "gender": "1",
    //         "birth_day": "1370/03/01",
    //         "amount_wallet": "13000"
    //     }
    // };
    // OR
    // data = {
    //     "status": "fail",
    //     "message": "کد وارد شده صحیح نیست",
    //     "data":  {
    //         "image": "images/profile.png",
    //         "name": "طاها شجریان",
    //         "phone": "09216317519",
    //         "gender": "1",
    //         "birth_day": "674956800"
    //     }
    // };
    return data;
};

const add_to_cart = (item_id, func) => {
    // آیدی یک محصول رو بهت میدم اضافه کن تو کارت و بهم بگو که کردی
    switch (func) {
        case "plus":
            // این آیدی را اضافه کن
            break;
        case "mines":
            // این ایدی را کم کن
            break;
        case "remove":
            // این ایدی را کلا حذف کن از تو کارت
            break;
        default:
            //
    }

    console.log("func=> ",func, item_id);
    $.post("backend/backend.php", {
        code: "add_to_cart",
        func: func,
        item_id: item_id
    }, function (data) {
        console.log("add_to_cart=>", data);
        result_add_to_cart(data, func);
    });
    //return data;
    // let data = {
    //     "status": "ok",
    //     "message": "success"
    // };
    // OR
    // data = {
    //     "status": "fail",
    //     "message": "خطا در ارتباط با سرور"
    // };
};

const get_around_pharm = (lat, long) => {
    console.log("lat=> ", lat," long=> ",long);
    // همینطور که میبینی لت و لانگ رو بهت میدم لیست شعب اطرافشو. بهم بده
    // اینکه چند تا بدی و چطوری بدی رو من نمیدونم
    spinner("start");
    $.post("backend/backend.php", {
        "code": "get_around_pharm",
        "lat": lat,
        "lng": long
     }, function (data) {
        console.log('location_mehrasghad', data);
        locations_update_list_sub_function(data, lat, long);
     });
    // let data = [
    //     {
    //         "id": "5",
    //         "name": "\u0631\u0633\u062a\u0648\u0631\u0627\u0646 \u0647\u0627\u0646\u06cc",
    //         "location": "35.6699543,51.4360217",
    //         "transport_fixed": "0",
    //         "transport_rate": "0"
    //     }, {
    //         "id": "6",
    //         "name": "\u0631\u0633\u062a\u0648\u0631\u0627\u0646 \u0627\u0645\u06cc\u0631",
    //         "location": "35.7229209,51.4082523",
    //         "transport_fixed": "0",
    //         "transport_rate": "0"
    //     }, {
    //         "id": "8",
    //         "name": "\u06a9\u062a\u0631\u06cc\u0646\u06af \u062a\u0647\u0631\u0627\u0646 \u067e\u062e\u062a",
    //         "location": "35.73524,51.410639",
    //         "transport_fixed": "1000",
    //         "transport_rate": "0"
    //     }, {
    //         "id": "9",
    //         "name": "\u0628\u0631\u06af\u0631 \u0632\u063a\u0627\u0644\u06cc",
    //         "location": "35.765287,51.437202",
    //         "transport_fixed": "1000",
    //         "transport_rate": "500"
    //     }, {
    //         "id": "10",
    //         "name": "\u0627\u0633\u06cc \u0628\u0631\u06af\u0631",
    //         "location": "35.7547337,51.4416537",
    //         "transport_fixed": "0",
    //         "transport_rate": "1000"
    //     }, {
    //         "id": "11",
    //         "name": "\u0646\u0627\u06cc\u0628 \u0622\u0641\u0631\u06cc\u0642\u0627",
    //         "location": "35.7782496,51.4207306",
    //         "transport_fixed": "1000",
    //         "transport_rate": "2000"
    //     }, {
    //         "id": "12",
    //         "name": "\u0628\u0631\u06af\u0631 \u0632\u063a\u0627\u0644\u06cc-  \u0638\u0641\u0631",
    //         "location": "35.765287,51.437202",
    //         "transport_fixed": "2000",
    //         "transport_rate": "1200"
    //     }, {
    //         "id": "13",
    //         "name": "\u0628\u0631\u06af\u0631 \u0632\u063a\u0627\u0644\u06cc - \u0642\u06cc\u0637\u0631\u06cc\u0647",
    //         "location": "35.793252,51.451993",
    //         "transport_fixed": "2000",
    //         "transport_rate": "1200"
    //     }, {
    //         "id": "14",
    //         "name": "\u067e\u06cc\u062a\u0632\u0627 \u067e\u06cc\u0634\u062e\u0648\u0627\u0646",
    //         "location": "35.723989, 51.421139",
    //         "transport_fixed": "0",
    //         "transport_rate": "1000"
    //     }, {
    //         "id": "15",
    //         "name": "\u0631\u0633\u062a\u0648\u0631\u0627\u0646 \u0634\u0627\u0646\u06cc",
    //         "location": "35.7391768,51.4443877",
    //         "transport_fixed": "1000",
    //         "transport_rate": "1500"
    //     }
    // ];
    return data;
};

const check_discount_code = (el) => {
    let code = $(el).closest("input").val();
    // این کد رو برو چک کن ببین درسته یا نه و بهم بگو
    let data = {
        "status": "ok",
        "message": "success",
        "data": "3000"
    };
    // or
    // data = {
    //      "status": "ok",
    //      "message": "success",
    //      "data": "3000"
    // }
    //
    apply_discount(data);
};

const use_wallet = () => {
    // کیف پول رو واسه این بچه اعمال کن
    let data = {
        "status": "ok",
        "message": "success",
    };
    apply_use_wallet(data);
};

const dont_use_wallet = () => {
    //اگه با یوزر آی دی بودش و طرف از دو پلتفرم استفاده کرد به مشکل میخوریم
    // کیف پول رو واسه این بچه اعمال کن
    let data = {
        "status": "ok",
        "message": "success",
    };
    apply_dont_use_wallet(data);
};

const update_user_data = (user_data) => {
    // با این دیتایی که بهت میدم اطلاعات یوزر رو آپدیت کن
    let data = {
        "status": "ok",
        "message": "success",
    };
    user.name = user_data.name;
    user.gender = user_data.gender;
    user.birth_day = user_data.birth_day;
    profile_fill(user, "#profile_page_1");
};

const get_shop_phone = (order_id) => {
    // اردر آیدی رو میدم شماره تلفن اونجا رو بهم بده
    let data = {
        "data": {
            "tel": "+982188888888"
        }
    };
    return data;
};

const get_order_repeat = (order_id) => {
    // یه اردر رو میخام تکرار کنم هرچی اردر رو کامل بهم بده
    let data = {
        "order_list": {
            0: {id: "6759", name: "آمین وی  4600 شکلاتی® قرص 243 عددی ", price: " 51/840 تومان ", count: 4},
            1: {id: "6758", name: "آمین وی  4600 شکلاتی® قرص 243 عددی ", price: " 51/840 تومان ", count: 1},
            2: {id: "6757", name: "آمین وی  4600 شکلاتی® قرص 243 عددی ", price: " 51/840 تومان ", count: 2},
            3: {id: "6756", name: "آمین وی  4600 شکلاتی® قرص 243 عددی ", price: " 51/840 تومان ", count: 1}
        },
        "vat": "2000",
        "transport": "5000",
        "discount": 13000,
        "address": "خیابان میاو.ند میدان قئس پایپاه 12 واحد 45"
    };
    return data;
};

const get_home_root = () => {
    spinner("start");
    // دسته های اصلای روت رو بده
let data;
    $.post("backend/backend.php", {
        "code": "get_root_item",
        "shop_id": 110
    }, function(data) {
        console.log("mehrshad", data);
        data = data.data;
        fill_home_root_item(data);
    });
};

const get_user = () => {
    $.post("backend/backend.php", {
        code: "get_user"
    }, function (data) {
        console.log(data);
        if (data.status == "ok") {
            user = data.data;
            if (user) snackbar(data.message, "green");
        }
    });
};

const update_user_name = (name) => {
    $.post("backend/backend.php", {
        name: name,
        code: "update_user_name"
    }, function (data) {
        result_update_user_name(data, name);
        
    });
};

const exit_user = () => {
    console.log('اومد این تو');
    spinner('start');
    $.post("backend/backend.php", {
        code: "exit_user"
    }, function (data) {
        console.log(data);
        result_exit_user(data);    
    });
};

const get_order = () => {
    $.post('backend/backend.php', {
        code: 'get_order'
    }, function(data) {
        count_all_items = 0;
        console.log('get_order=> ', data);
        if (data.item) order_list = data.item;
        $.each(order_list, function (index, value) {
           count_all_items += value.item_count;
        });
        if (count_all_items) $(".badget_bascket").text(count_all_items).css('display','flex').fadeIn();
        console.log(count_all_items);
    });
};